cool/tutorials/incompressible/pimpleDyMFoam/movingCone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        nFaces          85;
        startFace       3665;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          50;
        startFace       3750;
    }
    fixedWall
    {
        type            wall;
        nFaces          35;
        startFace       3800;
    }
    axis
    {
        type            symmetryPlane;
        nFaces          0;
        startFace       3835;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       3835;
    }
    farField
    {
        type            patch;
        nFaces          35;
        startFace       3865;
    }
    back
    {
        type            wedge;
        nFaces          1900;
        startFace       3900;
    }
    front
    {
        type            wedge;
        nFaces          1900;
        startFace       5800;
    }
)

// ************************************************************************* //
